Ohminecraft/ESP32-Attack-Tool/lib/Bad_Usb_Lib/BleKeyboard.cpp
bool BleKeyboard::isPressed(const uint16_t b)
{
	if ((b & _buttons) > 0)
		return true;
	return false;
}

void BleKeyboard::resetButtons() {
	memset(&_buttonsGamepad,0,sizeof(_buttonsGamepad));
	sendReport(&_keyReport);

}
void BleKeyboard::setAxes(int16_t x, int16_t y, int16_t a1, int16_t a2, int16_t a3, int16_t a4, int16_t a5, int16_t a6, signed char hat1, signed char hat2, signed char hat3, signed char hat4) {

 uint8_t m[26]; // 34
    memset(&m,0,sizeof(m));

    memcpy(&m, &_buttonsGamepad, sizeof(_buttonsGamepad));
    m[16] = x;
    m[17] = y;
    m[18] = a1; // z
    m[19] = a2; // rx
    m[20] = a3; // ry
    m[21] = a4; // rz
    m[22] = a5; // slider
    m[23] = a6; // dial
    m[24] = hat1 | (hat2 << 4); // 1 and 2
    m[25] = hat3 | (hat4 << 4); // 3 and 4 
    
    //memset(&m,0, sizeof(m));
    this->inputGamepad->setValue(m, sizeof(m));
    this->inputGamepad->notify();

}
size_t BleKeyboard::pressButton(uint8_t b) {
	char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint8_t result = _buttonsGamepad[index] | bitmask;
  if (result != _buttonsGamepad[index]) {
    _buttonsGamepad[index] = result;
  }
 return result;

}
size_t BleKeyboard::releaseButton(uint8_t b) {
 char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _buttonsGamepad[index] & ~bitmask;
    _buttonsGamepad[index] = result;
  return result;

}
bool BleKeyboard::isPressedButton(uint8_t b) {
  char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  if ((bitmask & _buttonsGamepad[index]) > 0)
    return true;
  return false;	
}

//void BleKeyboard::onConnect(NimBLEServer *pServer, NimBLEConnInfo& connInfo) {}

void BleKeyboard::onDisconnect(NimBLEServer *pServer, NimBLEConnInfo& connInfo, int reason) {
  this->connected = false;
}

//void BleKeyboard::onWrite(BLECharacteristic* me) {
void BleKeyboard::onWrite(NimBLECharacteristic * me, NimBLEConnInfo & 	connInfo) {
  uint8_t* value = (uint8_t*)(me->getValue().c_str());
  (void)value;
  ESP_LOGI(LOG_TAG, "special keys: %d", *value);
}

void BleKeyboard::delay_ms(uint64_t ms) {
  uint64_t m = esp_timer_get_time();
  if(ms){
    uint64_t e = (m + (ms * 1000));
    if(m > e){ //overflow
        while(esp_timer_get_time() > e) { }
    }
    while(esp_timer_get_time() < e) {}
  }
}
void BleKeyboard::onAuthenticationComplete(NimBLEConnInfo& connInfo) {
    if (connInfo.isEncrypted()) {
        Serial.println("[INFO] Paired successfully.");
        this->connected = true;
    } else {
        Serial.println("[ERROR] Pairing failed");
    }
}

void BleKeyboard::onSubscribe(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo &connInfo, uint16_t subValue ) {
    if (subValue == 0) {
        Serial.println("[INFO] Client unsubscribed from notifications/indications.");
    } else {
        Serial.println("[INFO] Client subscribed to notifications.");
    }
}